# -*- coding: utf-8 -*-
"""
# Created on Sun Oct 17 17:51:54 2021

# @author: 11870
# """
# gw170817 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续1秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw231211 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续2秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw251001 = {'信息源': '中子星源',
#             '信号持续时间': '信号持续88秒',
#             '有无电磁对应体': '有电磁对应体',}
# gw271101 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续2秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw281202 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续2秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw291111 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续1秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw330201 = {'信息源': '黑洞源',
#             '信号持续时间': '信号持续2秒',
#             '有无电磁对应体': '无电磁对应体',}
# gw_things=[gw170817,gw231211,gw251001,gw271101,
#            gw281202,gw291111,gw330201]
# b=gw_things[:]
# for gw_thing in gw_things:
#     if gw_thing['信息源'] == '黑洞源':
#         b.remove(gw_thing)
# gw_things=b
# print(gw_things)



import numpy as np
a=1j*np.random.uniform(0, 2*np.pi, (20,2))